Revit 2027 API
BuiltInFailures.SlabFailures Class
 Failures about Slab.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SlabFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SlabFailures
Public NotInheritable Class SlabFailures
public ref class SlabFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SlabFailures = class end
The BuiltInFailures.SlabFailures type exposes the following members.
Properties
Name | Description
CantileverValueTooBig |  Cantilever value is too big.
Top
See Also
Reference
Autodesk.Revit.DB Namespace